Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
// Estymator zuzycia: probki w RTC RAM (przezywaja sen, znikaja po zaniku zasilania
// = dokladnie jeden cykl rozladowania). Zero zapisow do flash w trakcie pracy.
static RTC_DATA_ATTR DrainState g_drain;
static RTC_DATA_ATTR int        g_lastSummaryDay;
static RTC_DATA_ATTR uint8_t g_wifiBssid[6];
static RTC_DATA_ATTR int32_t g_wifiChannel;
static RTC_DATA_ATTR bool    g_wifiHint;

// Diagnostyka produkcyjna. RTC RAM przezywa deep-sleep (noce/budziki), znika po
// zaniku zasilania = jeden cykl pracy ogniwa. Zerowane na cold boot w setup().
static RTC_DATA_ATTR uint16_t g_bootCount;        // liczba rozruchow od zimnego startu
static RTC_DATA_ATTR int64_t  g_coldBootEpoch;    // czas pierwszego poprawnego odczytu (UTC, 0=jeszcze nieznany)
static RTC_DATA_ATTR int32_t  g_lastRtcDriftSec;  // RTC - NTP przy ostatniej synchronizacji
static RTC_DATA_ATTR int64_t  g_lastNtpSyncEpoch; // moment ostatniej udanej synchronizacji NTP (UTC)
static RTC_DATA_ATTR int64_t  g_prevNtpSyncEpoch; // poprzednia synchronizacja (okno do liczenia dryftu)
// Dozywotnie liczniki "zlych" resetow — backowane w NVS (zdarzenia rzadkie).
static uint32_t g_brownoutResets = 0;
static uint32_t g_wdtResets      = 0;
static uint32_t g_panicResets    = 0;

// Stan "dzwonienia" budzika (ponawianie az do wyciszenia / timeoutu)
static bool    ringing = false;
static int     ringingAlarm = -1;          // ktory budzik dzwoni (indeks)
static uint32_t ringStartMs = 0;
static uint32_t ringLastRetryMs = 0;
static uint8_t  ringErrors = 0;
static uint32_t soundStartedMs = 0;        // start ostatniego odtwarzania (wykrywanie plikow padajacych natychmiast)

static int lastDrawMinute = -1;
static int lastDrawDay = -1;
// Sygnatura widocznej tresci strony zegara (patrz clockSig). Sentinel 0xFFFFFFFF
// wymusza repaint (cold boot, powrot z innej strony). Dzieki niej zmiany pol
// niepokazywanych na zegarze (ntpStatus/statusText) NIE odswiezaja panelu.
static uint32_t lastClockSig = 0xFFFFFFFFu;

// Dedup wyzwolen — przezywa deep-sleep (RTC RAM), zerowany tylko na cold boot.
static RTC_DATA_ATTR int lastTriggerDay[ALARM_COUNT];

// RTC RAM: przezywa deep-sleep (kazde wybudzenie z deep-sleep rebootuje uklad i bez
// RTC RAM zerowaloby znacznik -> ponowna synchronizacja NTP po wybudzeniu, mimo ze
// dzis juz zsynchronizowano). Zerowany na cold boot.
static RTC_DATA_ATTR int ntpStartedDay;
// Osobny licznik dnia dla porannej re-synchronizacji (wybudzenie z trybu nocnego
// ~06:00). Oddzielny od ntpStartedDay, by sync 06:00 NIE blokowal planowego 10:00.
static RTC_DATA_ATTR int ntpMorningDay;
static uint8_t  ntpRetriesLeft = 0;
static uint32_t ntpNextRetryMs = 0;
static uint32_t ntpFailureRetryDelayMs = NTP_RETRY_MS;
static uint8_t  rtcWriteRetriesLeft = 0;
static uint32_t rtcWriteNextRetryMs = 0;
static uint32_t batteryNextReadMs = 0;

static bool     keyRaw = HIGH, keyStable = HIGH;
static uint32_t keyChangedMs = 0;
static bool     bootRaw = HIGH, bootStable = HIGH;
static uint32_t bootChangedMs = 0, bootPressedMs = 0;
static bool     previewActive = false;
static uint32_t previewUntilMs = 0;

static const gpio_num_t HOLD_PINS[] = {
  (gpio_num_t)RLCD_DC_PIN, (gpio_num_t)RLCD_CS_PIN, (gpio_num_t)RLCD_SCK_PIN,
  (gpio_num_t)RLCD_MOSI_PIN, (gpio_num_t)RLCD_RST_PIN
};

// Prototypy
static void stopPlayback(bool userStopped);
static bool startSound(uint8_t soundIndex, uint8_t volume);
static void startRinging(int alarmIndex);
static bool ensureCodec();
static void shutdownCodec();
static void updateBattery(bool force);
static bool syncNtp(bool manual);
static bool serviceNtp();
static void checkAlarms(uint32_t lateWindowSec = ALARM_LATE_WINDOW_SEC);
static void enterNightSleepIfNeeded(bool force);
static void showPreview();

// ============================================================================
//  Czas — konwersje cywilne i RTC PCF85063A
// ============================================================================
static int daysFromCivil(int y, unsigned m, unsigned d) {
  y -= m <= 2;
  const int era = (y >= 0 ? y : y - 399) / 400;
  const unsigned yoe = (unsigned)(y - era * 400);
  const unsigned doy = (153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1;
  const unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
  return era * 146097 + (int)doe - 719468;
}

static time_t utcEpochFromCivil(int y, int mo, int d, int h, int mi, int s) {
  return (time_t)daysFromCivil(y, (unsigned)mo, (unsigned)d) * 86400 + h * 3600 + mi * 60 + s;
}

static int localDayKey(const struct tm &t) {
  return (t.tm_year + 1900) * 400 + t.tm_yday;
}

static bool isNightMode(const struct tm &t) {
  int now = t.tm_hour * 60 + t.tm_min;
  int start = NIGHT_START_HOUR * 60 + NIGHT_START_MIN;
  int end   = NIGHT_END_HOUR * 60 + NIGHT_END_MIN;
  if (start < end) return now >= start && now < end;
  if (start > end) return now >= start || now < end;
  return false;
}

static bool isSupportedEpoch(time_t epoch) {
  if (epoch < 1700000000) return false;
  struct tm gm;
  gmtime_r(&epoch, &gm);
  int year = gm.tm_year + 1900;
  return year >= 2024 && year <= 2099;
}

static bool getLocalTm(struct tm *out) {
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return false;
  localtime_r(&now, out);
  return true;
}

static void setSystemEpoch(time_t epoch) {
  struct timeval tv = { .tv_sec = epoch, .tv_usec = 0 };
  settimeofday(&tv, nullptr);
}

static time_t epochForClock(struct tm base, int h, int mi, int s, int addDays) {
  base.tm_hour = h; base.tm_min = mi; base.tm_sec = s;
  base.tm_mday += addDays;     // mktime normalizuje przepelnienie dnia/miesiaca
  base.tm_isdst = -1;          // niech mktime sam ustali DST dla danej daty
  return mktime(&base);        // poprawne przez noc zmiany czasu (doba != 86400 s)
}

static bool alarmDueNow(const struct tm &nowTm, time_t now, uint8_t h, uint8_t mi,
                        uint8_t s, uint32_t lateWindowSec, int *occurrenceDay) {
  time_t alarmAt = epochForClock(nowTm, h, mi, s, 0);
  if (alarmAt > now) alarmAt = epochForClock(nowTm, h, mi, s, -1);
  time_t delaySec = now - alarmAt;
  if (delaySec < 0 || (uint64_t)delaySec > lateWindowSec) return false;

