Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
  if (occurrenceDay) {
    struct tm alarmTm;
    localtime_r(&alarmAt, &alarmTm);
    *occurrenceDay = localDayKey(alarmTm);
  }
  return true;
}

static uint8_t bcd2dec(uint8_t v) { return (v >> 4) * 10 + (v & 0x0F); }
static uint8_t dec2bcd(uint8_t v) { return (uint8_t)(((v / 10) << 4) | (v % 10)); }
static bool    validBcd(uint8_t v) { return (v & 0x0F) <= 9 && ((v >> 4) & 0x0F) <= 9; }

static bool leapYear(int y) { return (y % 4 == 0 && y % 100 != 0) || (y % 400 == 0); }

static uint8_t daysInMonth(int y, int m) {
  static const uint8_t md[] = { 31,28,31,30,31,30,31,31,30,31,30,31 };
  if (m == 2 && leapYear(y)) return 29;
  return md[m - 1];
}

static bool validDateTime(int y, int mo, int d, int h, int mi, int s) {
  if (y < 2024 || y > 2099 || mo < 1 || mo > 12) return false;
  if (d < 1 || d > daysInMonth(y, mo)) return false;
  return h >= 0 && h <= 23 && mi >= 0 && mi <= 59 && s >= 0 && s <= 59;
}

static bool rtcBeginSession() {
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(400000);
  Wire.beginTransmission(PCF85063A_ADDR);
  return Wire.endTransmission() == 0;
}

// Pojedynczy zapis rejestru RTC. Wolajacy odpowiada za wczesniejsze rtcBeginSession()
// (gdy jest wymagane) — tak samo jak dotychczasowe rozwiniete idiomy.
static bool rtcWriteReg(uint8_t reg, uint8_t value) {
  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(reg);
  Wire.write(value);
  return Wire.endTransmission() == 0;
}

// Odczyt n rejestrow RTC od 'reg' jednym transferem. NIE wola rtcBeginSession():
// wolajacy juz otworzyl sesje. Zachowanie identyczne z dotychczasowymi idiomami
// (te same casty, ta sama kolejnosc, ten sam warunek bledu).
static bool rtcReadRegs(uint8_t reg, uint8_t *buf, uint8_t n) {
  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((uint8_t)PCF85063A_ADDR, n) != n) return false;
  for (uint8_t i = 0; i < n; i++) buf[i] = Wire.read();
  return true;
}

static bool rtcReadControl1(uint8_t *control1) {
  if (!control1 || !rtcBeginSession()) return false;
  return rtcReadRegs(0x00, control1, 1);
}

static bool rtcReadControl2(uint8_t *control2) {
  if (!control2 || !rtcBeginSession()) return false;
  return rtcReadRegs(0x01, control2, 1);
}

static bool rtcWriteControl1(uint8_t control1) {
  return rtcWriteReg(0x00, control1);
}

static bool rtcReleaseClock(uint8_t runningControl1) {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    if (rtcWriteControl1(runningControl1)) return true;
    delay(2);
  }
  return false;
}

// Zatrzymaj licznik przed ustawieniem czasu. STOP zeruje glowna czesc
// preskalera, dzieki czemu pierwszy impuls sekundowy ma okreslona faze.
static bool rtcPrepareTimeWrite(uint8_t *runningControl1) {
  if (!runningControl1) return false;
  uint8_t control1;
  if (!rtcReadControl1(&control1)) return false;
  *runningControl1 = control1 &
                     (uint8_t)~((1U << 7) | (1U << 5) | (1U << 2) | (1U << 1));
  if (rtcWriteControl1(*runningControl1 | (1U << 5))) return true;
  rtcReleaseClock(*runningControl1);
  return false;
}

static bool rtcHasCurrentFormat() {
  uint8_t marker;                  // 0x03 RAM_byte — bez rtcBeginSession (sesja juz otwarta)
  return rtcReadRegs(0x03, &marker, 1) && marker == RTC_FORMAT_MARKER;
}

static bool rtcStoreCurrentFormat() {
  return rtcWriteReg(0x03, RTC_FORMAT_MARKER);   // RAM_byte
}

static bool rtcInvalidateCurrentFormat() {
  return rtcWriteReg(0x03, 0);                    // RAM_byte
}

// Odczyt 7 rejestrow czasu (0x04..0x0A) jednym transferem → brak rwania na granicy sekundy.
// Rejestr roku 00..99 reprezentuje lata 2000..2099. Taka baza zachowuje
// zgodnosc sprzetowego obliczania lat przestepnych w PCF85063A.
static bool readRtcEpochInternal(time_t *epoch, bool requireCurrentFormat) {
  if (!epoch) return false;
  uint8_t control1;
  if (!rtcReadControl1(&control1)) return false;

  // Nie wznawiaj po cichu zatrzymanego lub przestawionego RTC. Przy aktywnym
  // markerze oznaczaloby to zaakceptowanie starego czasu jako aktualnego.
  const uint8_t invalidModeMask = (1U << 7) | (1U << 5) | (1U << 1);
  if ((control1 & invalidModeMask) != 0 ||
      (requireCurrentFormat && !rtcHasCurrentFormat())) return false;

  uint8_t t[7];
  if (!rtcReadRegs(0x04, t, 7)) return false;
  uint8_t secReg  = t[0];
  uint8_t minReg  = t[1];
  uint8_t hourReg = t[2];
  uint8_t dayReg  = t[3];
  // t[4] = dzien tygodnia — pomijamy
  uint8_t monReg  = t[5];
  uint8_t yearReg = t[6];

  bool oscStopped = (secReg & 0x80) != 0;
  secReg &= 0x7F; minReg &= 0x7F; hourReg &= 0x3F; dayReg &= 0x3F; monReg &= 0x1F;

  if (oscStopped || !validBcd(secReg) || !validBcd(minReg) || !validBcd(hourReg) ||
      !validBcd(dayReg) || !validBcd(monReg) || !validBcd(yearReg)) {
    return false;
  }

  int s  = bcd2dec(secReg);
  int mi = bcd2dec(minReg);
  int h  = bcd2dec(hourReg);
  int d  = bcd2dec(dayReg);
  int mo = bcd2dec(monReg);
  int y  = bcd2dec(yearReg) + 2000;

  if (!validDateTime(y, mo, d, h, mi, s)) return false;
  *epoch = utcEpochFromCivil(y, mo, d, h, mi, s);
  return true;
}

static bool readRtcEpoch(time_t *epoch) {
  return readRtcEpochInternal(epoch, true);
}

static bool readRtcToSystem() {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    time_t epoch;
    if (readRtcEpoch(&epoch)) {
      setSystemEpoch(epoch);
      return true;
    }
    delay(2);
  }
  return false;
}

// Zapis lustrzany do readRtcToSystem: RTC przechowuje czas UTC i rok 00..99
// dla zakresu 2000..2099.
static bool writeRtc(time_t epoch) {
  if (!isSupportedEpoch(epoch)) return false;

  // Wyrownanie do granicy sekundy. Po zwolnieniu STOP preskaler PCF85063A startuje
  // od zera, wiec wpisana sekunda "trzyma sie" przez pelne ~1.0 s -> faza przewrotu
  // sekundy = chwila zwolnienia STOP. Dotychczas zapisywano uciety time_t (ulamek
  // sekundy z NTP gubiony) i zwalniano od razu po I2C -> RTC stale spozniony o
  // 0.5-1 s; po ~20 h do wybudzenia 06:00 skladalo sie to na ~3 s. Dlatego zapisz
  // NASTEPNA pelna sekunde i zwolnij STOP dokladnie, gdy zegar systemowy ja osiagnie.
  struct timeval tv;
  gettimeofday(&tv, nullptr);
  time_t writeEpoch = epoch;
  bool   alignToBoundary = false;
  // Wyrownuj tylko gdy 'epoch' to biezacy czas systemowy (tak robia wszyscy wolajacy:
  // time(nullptr) / syncedEpoch). Inny epoch -> zapis 1:1, bez czekania na granice.
  // Pomin wyrownanie gdy gra audio/budzik lub trwa sesja WWW: busy-wait do ~1 s
  // przerwalby audio.loop() (underrun I2S) i wstrzymal server.handleClient().
  // W tych rzadkich zbieznych przypadkach przyjmij ulamkowy blad fazy sekundy RTC
  // (jednorazowy, nieskumulowany — to swiezy zapis z NTP).
  if (!playing && !ringing && !webActive &&
      isSupportedEpoch(tv.tv_sec) && (tv.tv_sec == epoch || tv.tv_sec + 1 == epoch)) {
    writeEpoch = tv.tv_sec + 1;          // najblizsza nadchodzaca pelna sekunda
    alignToBoundary = true;
  }

