Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
  struct tm gm;
  gmtime_r(&writeEpoch, &gm);
  int year = gm.tm_year + 1900;

  // Najpierw uniewaznij dane. Reset w dowolnym dalszym miejscu nie moze
  // ujawnic niepelnego zapisu jako poprawnego czasu.
  if (!rtcBeginSession()) return false;
  if (!rtcInvalidateCurrentFormat()) return false;
  uint8_t runningControl1;
  if (!rtcPrepareTimeWrite(&runningControl1)) return false;
  uint8_t yearReg = (uint8_t)(year % 100);

  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(0x04);
  Wire.write(dec2bcd(gm.tm_sec) & 0x7F);            // OS=0 → oscylator OK
  Wire.write(dec2bcd(gm.tm_min) & 0x7F);
  Wire.write(dec2bcd(gm.tm_hour) & 0x3F);           // 24h
  Wire.write(dec2bcd(gm.tm_mday) & 0x3F);
  Wire.write((uint8_t)(gm.tm_wday & 0x07));
  Wire.write(dec2bcd((uint8_t)(gm.tm_mon + 1)) & 0x1F);
  Wire.write(dec2bcd(yearReg));
  bool registersWritten = Wire.endTransmission() == 0;
  if (!registersWritten) { rtcReleaseClock(runningControl1); return false; }

  // Odczekaj do granicy docelowej sekundy, potem zwolnij STOP. Czas zuzyty na I2C
  // jest wliczony (porownanie do tej samej bazy gettimeofday). Maks. czekanie ~1 s.
  if (alignToBoundary) {
    struct timeval nowTv;
    for (;;) {
      gettimeofday(&nowTv, nullptr);
      long remainingUs = (long)(writeEpoch - nowTv.tv_sec) * 1000000L - nowTv.tv_usec;
      if (remainingUs <= 0) break;
      if (remainingUs > 2000) delay(1); else delayMicroseconds((uint32_t)remainingUs);
    }
  }
  bool clockReleased = rtcReleaseClock(runningControl1);   // zwolnienie na granicy sekundy
  if (!clockReleased) return false;

  // Marker nadal jest niewazny. Najpierw sprawdz surowe rejestry, a dopiero
  // po poprawnej weryfikacji oznacz zapis jako gotowy do uzycia przy starcie.
  time_t verifiedEpoch;
  if (!readRtcEpochInternal(&verifiedEpoch, false)) return false;
  long long rtcDifference = (long long)verifiedEpoch - (long long)writeEpoch;
  if (rtcDifference < -2 || rtcDifference > 2) return false;
  if (rtcStoreCurrentFormat() && rtcHasCurrentFormat()) return true;
  rtcInvalidateCurrentFormat();
  return false;
}

// INT ma sluzyc wylacznie alarmowi wybudzajacemu. Wylacz korekcje, MI/HMI
// i countdown timer, a przy okazji skasuj pozostawione flagi AF/TF.
static bool rtcConfigureWakeInterrupt(bool alarmEnabled) {
  uint8_t control1;
  if (!rtcReadControl1(&control1)) return false;
  control1 &= (uint8_t)~(1U << 2);                   // CIE=0
  if (!rtcWriteReg(0x00, control1)) return false;

  // Najpierw zatrzymaj timer i jego przerwanie. PCF85063A wymaga TE=0 przed
  // zmiana Timer_value, inaczej pierwszy okres po zmianie jest nieokreslony.
  if (!rtcWriteReg(0x11, 0x18)) return false;        // Timer_mode: TCF=1/60 Hz, TE=0, TIE=0
  if (!rtcWriteReg(0x10, 0)) return false;           // Timer_value

  uint8_t control2;
  if (!rtcReadControl2(&control2)) return false;
  // COF=111 wylacza wyjscie CLKOUT (nieuzywane) -> mniejszy pobor RTC.
  control2 = (uint8_t)(0x07 | (alarmEnabled ? (1U << 7) : 0));
  return rtcWriteReg(0x01, control2);                // AF=TF=MI=HMI=0, CLKOUT off
}

static bool rtcVerifyWakeInterruptConfig(bool alarmEnabled) {
  uint8_t control1, control2;
  if (!rtcReadControl1(&control1) || !rtcReadControl2(&control2)) return false;

  if (!rtcBeginSession()) return false;
  uint8_t timer[2];
  if (!rtcReadRegs(0x10, timer, 2)) return false;
  uint8_t timerValue = timer[0];
  uint8_t timerMode = timer[1];

  uint8_t expectedControl2 = alarmEnabled ? (1U << 7) : 0;
  return (control1 & (1U << 2)) == 0 &&              // CIE=0
         (control2 & 0xF8) == expectedControl2 &&    // AIE zgodnie z zadaniem, flagi=0
         timerValue == 0 &&
         timerMode == 0x18;                          // TCF=1/60 Hz, TE=TIE=TI_TP=0
}

static bool rtcVerifyWakeAlarm(time_t epoch) {
  struct tm gm;
  gmtime_r(&epoch, &gm);

  if (!rtcBeginSession()) return false;
  uint8_t alarmRegs[5];
  if (!rtcReadRegs(0x0B, alarmRegs, 5)) return false;
  if (alarmRegs[0] != (dec2bcd((uint8_t)gm.tm_sec) & 0x7F) ||
      alarmRegs[1] != (dec2bcd((uint8_t)gm.tm_min) & 0x7F) ||
      alarmRegs[2] != (dec2bcd((uint8_t)gm.tm_hour) & 0x3F) ||
      alarmRegs[3] != (dec2bcd((uint8_t)gm.tm_mday) & 0x3F) ||
      alarmRegs[4] != 0x80) {
    return false;
  }

  return rtcVerifyWakeInterruptConfig(true);
}

// Alarm PCF85063A pracuje w UTC, tak samo jak rejestry czasu RTC.
// INT jest aktywne stanem niskim i pozostaje niskie do skasowania flagi AF.
static bool rtcSetWakeAlarm(time_t epoch) {
  time_t systemNow = time(nullptr);
  if (!isSupportedEpoch(epoch) || !isSupportedEpoch(systemNow)) return false;
  time_t rtcNow;
  // readRtcEpoch() odrzuca STOP, EXT_TEST i tryb 12 h. Nie uruchamiaj tutaj
  // zatrzymanego RTC, bo jego stary czas moglby zostac uznany za aktualny.
  if (!readRtcEpoch(&rtcNow)) return false;
  long long rtcSkew = (long long)rtcNow - (long long)systemNow;
  if (rtcSkew < -RTC_WAKE_MAX_SKEW_SEC || rtcSkew > RTC_WAKE_MAX_SKEW_SEC) return false;
  if (!rtcConfigureWakeInterrupt(false)) return false;

  struct tm gm;
  gmtime_r(&epoch, &gm);

  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(0x0B);
  Wire.write(dec2bcd((uint8_t)gm.tm_sec) & 0x7F);
  Wire.write(dec2bcd((uint8_t)gm.tm_min) & 0x7F);
  Wire.write(dec2bcd((uint8_t)gm.tm_hour) & 0x3F);
  Wire.write(dec2bcd((uint8_t)gm.tm_mday) & 0x3F);
  Wire.write((uint8_t)0x80);                         // weekday alarm disabled
  if (Wire.endTransmission() != 0) return false;

  if (rtcConfigureWakeInterrupt(true) && rtcVerifyWakeAlarm(epoch)) return true;
  rtcConfigureWakeInterrupt(false);
  return false;
}

static bool rtcDisableWakeAlarm() {
  return rtcConfigureWakeInterrupt(false) &&
         rtcVerifyWakeInterruptConfig(false);
}

// ============================================================================
//  Ustawienia (NVS)
// ============================================================================
static const char *NVS_NS = "zegar3";   // przestrzen nazw Preferences (alarmy, WiFi, drain, liczniki resetow)

static void setDefaultAlarms() {
  for (int i = 0; i < ALARM_COUNT; i++) {
    alarms[i].enabled = 0;
    alarms[i].hour = 7;
    alarms[i].minute = 0;
    alarms[i].second = 0;
    alarms[i].volume = DEFAULT_AUDIO_VOLUME;
    alarms[i].sound = (uint8_t)i;          // domyslnie budzik i → dzwiek i
    snprintf(alarms[i].label, sizeof(alarms[i].label), "Budzik %d", i + 1);
  }
}

