Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
    if (lower.endsWith(".bak") && path.length() > 5) {
      String target = path.substring(0, path.length() - 4);
      bool changed = dataFS->exists(target) ? dataFS->remove(path)
                                            : dataFS->rename(path, target);
      if (changed) { root.close(); return true; }
    } else if (lower.endsWith(".part") && path.length() > 6) {
      String target = path.substring(0, path.length() - 5);
      String backup = target + ".bak";
      // Najpierw galaz .bak musi odtworzyc plik docelowy (kolejny przebieg);
      // dopiero wtedy .part jest bezpiecznie zbedny.
      if (dataFS->exists(backup) && !dataFS->exists(target)) continue;
      if (dataFS->remove(path)) { root.close(); return true; }
    }
  }
  root.close();
  return false;
}

static void recoverSoundFiles() {
  if (!dataFS) return;
  for (uint8_t pass = 0; pass < 16 && recoverSoundFilesOnce(); pass++) {}
}

static bool ensureFsMounted() {
  if (fsMounted && dataFS) return true;
  struct { fs::FS *fs; const char *name; bool ok; } cands[] = {
    { &SPIFFS,   "SPIFFS",   SPIFFS.begin(false) },
    { &LittleFS, "LittleFS", false },
    { &FFat,     "FFat",     false },
  };
  if (!cands[0].ok) cands[1].ok = LittleFS.begin(false);
  if (!cands[0].ok && !cands[1].ok) cands[2].ok = FFat.begin(false);
  for (auto &c : cands) {
    if (c.ok) {
      fsMounted = true; dataFS = c.fs; dataFSName = c.name;
      recoverSoundFiles();
      Serial.printf("System plikow: %s\n", c.name);
      return true;
    }
  }
  // Fabrycznie czysty flash / po erase_flash: partycja danych niesformatowana,
  // a MP3 mozna wgrac tylko przez WWW, ktore wymaga FS -> pat bez wyjscia.
  // Jednorazowy format SPIFFS go przerywa; nic sie nie zamontowalo, wiec nie
  // ma danych do stracenia.
  static bool formatTried = false;
  if (!formatTried) {
    formatTried = true;
    Serial.println("Brak FS - formatuje SPIFFS...");
    if (SPIFFS.begin(true)) {
      fsMounted = true; dataFS = &SPIFFS; dataFSName = "SPIFFS";
      Serial.println("System plikow: SPIFFS (nowo sformatowany)");
      return true;
    }
  }
  fsMounted = false; dataFS = nullptr; dataFSName = "brak";
  Serial.println("Brak systemu plikow z MP3");
  return false;
}

// ============================================================================
//  Audio
// ============================================================================
static void audioInfo(Audio::msg_t m) {
  Serial.printf("Audio %s: %s\n", m.s ? m.s : "", m.msg ? m.msg : "");
}

static bool audioPinsReady = false;

// Konfiguracja I2S wykonywana tylko raz. Przy ponownym budzeniu kodeka NIE
// przeinicjowujemy sterownika I2S — odswiezamy jedynie ES8311 przez codec.begin().
static void ensureAudioPins() {
  if (audioPinsReady) return;
  Audio::audio_info_callback = audioInfo;
  audio.setPinout(I2S_BCLK_PIN, I2S_WS_PIN, I2S_DOUT_PIN, I2S_MCLK_PIN);
  audio.setOutput48KHz(true);
  audio.setVolume(DEFAULT_AUDIO_VOLUME);
  audioPinsReady = true;
}

static bool ensureCodec() {
  if (audioReady) return true;
  pinMode(PA_ENABLE_PIN, OUTPUT);
  // Wzmacniacz wlacza dopiero startSound() PO pelnej konfiguracji kodeka.
  // PA aktywny podczas resetu ES8311 = trzask w glosniku przed kazdym dzwonieniem.
  digitalWrite(PA_ENABLE_PIN, LOW);

  ensureAudioPins();

  audioReady = codec.begin(I2C_SDA_PIN, I2C_SCL_PIN, 400000);
  if (audioReady) {
    codec.setVolume(CODEC_VOLUME_PERCENT);
    codec.configBits16();
  } else {
    Serial.println("ES8311 init failed");
    digitalWrite(PA_ENABLE_PIN, LOW);
  }
  return audioReady;
}

// Uspij kodek po zakonczeniu odtwarzania/dzwonienia. ES8311 jest zasilany ze
// stalej szyny 3V3 (snu CPU go nie wylacza), wiec to najwiekszy odbiornik w
// spoczynku. Kolejny dzwiek odtworzy startSound() -> ensureCodec() (pelna
// reinicjalizacja kodeka), wiec zadna funkcja nie znika.
static void shutdownCodec() {
  if (!audioReady) {
    digitalWrite(PA_ENABLE_PIN, LOW);
    return;
  }
  audio.stopSong();
  codec.powerDown();
  digitalWrite(PA_ENABLE_PIN, LOW);
  audioReady = false;
}

// Odtworz wskazany plik dzwiekowy jednokrotnie.
static bool startSound(uint8_t soundIndex, uint8_t volume) {
  stopPlayback(false);
  if (soundIndex >= SOUND_COUNT) soundIndex = 0;
  if (!ensureFsMounted() || !ensureCodec()) {
    statusText = "blad FS/kodek";
    displayDirty = true;
    return false;
  }

  const char *path = SOUND_FILES[soundIndex];
  if (!dataFS->exists(path)) {
    shutdownCodec();
    statusText = String("brak ") + path;
    displayDirty = true;
    return false;
  }

  digitalWrite(PA_ENABLE_PIN, HIGH);
  audio.stopSong();
  audio.setVolume(constrain(volume, 0, MAX_AUDIO_VOLUME));
  codec.setVolume(CODEC_VOLUME_PERCENT);
  if (!audio.connecttoFS(*dataFS, path)) {
    shutdownCodec();
    statusText = String("blad odtw. ") + path;
    displayDirty = true;
    return false;
  }

  soundStartedMs = millis();
  playing = true;
  Serial.printf("Odtwarzam %s vol=%u\n", path, volume);
  displayDirty = true;
  return true;
}

static void stopPlayback(bool userStopped) {
  if (userStopped) {
    ringing = false;
    ringingAlarm = -1;
    ringErrors = 0;
  }
  if (audioReady) {
    audio.stopSong();
    audio.setVolume(0);
    codec.setVolume(0);
    digitalWrite(PA_ENABLE_PIN, LOW);
  }
  if (playing) {
    statusText = userStopped ? "STOP" : "koniec";
    playing = false;
    displayDirty = true;
  }
}

// Wejscie w stan dzwonienia: ponawiaj odtwarzanie wybranego dzwieku az do wyciszenia.
static void startRinging(int alarmIndex) {
  ringing = true;
  ringingAlarm = alarmIndex;
  ringStartMs = millis();
  ringLastRetryMs = millis();
  ringErrors = 0;
  statusText = String("BUDZI: ") + alarms[alarmIndex].label;
  displayDirty = true;
  if (!startSound(alarms[alarmIndex].sound, alarms[alarmIndex].volume)) {
    ringErrors = 1;
    ringLastRetryMs = millis() - RING_RETRY_MS;
  }
}

