Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
static void serviceAudio() {
  if (!playing) return;
  if (!audioReady) {
    playing = false;
    digitalWrite(PA_ENABLE_PIN, LOW);
    if (!ringing) statusText = "audio stop";
    displayDirty = true;
    return;
  }
  audio.loop();
  if (!audio.isRunning()) {
    if (ringing) {
      // Petla dzwonienia obsluzy ponowne odtworzenie w serviceRinging().
      // connecttoFS() zwraca true dla KAZDEGO istniejacego pliku, a uszkodzony
      // MP3 "konczy sie" po kilkudziesieciu ms. Bez zliczania takich prob budzik
      // krecil sie bezglosnie przez cale RING_TIMEOUT_MS (15 min ciszy).
      playing = false;
      if (millis() - soundStartedMs < RING_MIN_PLAY_MS) {
        if (++ringErrors >= RING_MAX_ERRORS) {
          statusText = "budzik: blad MP3";
          ringing = false;
          ringingAlarm = -1;
        }
      } else {
        ringErrors = 0;
      }
      displayDirty = true;
      return;
    }
    stopPlayback(false);
  }
}

static void serviceRinging() {
  if (!ringing) return;

  if (millis() - ringStartMs > RING_TIMEOUT_MS) {
    statusText = "budzik: timeout";
    stopPlayback(false);
    ringing = false;
    ringingAlarm = -1;
    displayDirty = true;
    return;
  }
  if (playing) return;
  if (millis() - ringLastRetryMs < RING_RETRY_MS) return;

  ringLastRetryMs = millis();
  if (ringingAlarm >= 0 &&
      startSound(alarms[ringingAlarm].sound, alarms[ringingAlarm].volume)) {
    // ringErrors zeruje dopiero serviceAudio() po odtworzeniu >= RING_MIN_PLAY_MS;
    // sukces connecttoFS() niczego nie dowodzi (uszkodzony plik tez "startuje").
    return;
  }
  if (++ringErrors >= RING_MAX_ERRORS) {
    statusText = "budzik: blad MP3";
    ringing = false;
    ringingAlarm = -1;
    displayDirty = true;
  }
}

// ============================================================================
//  Akumulator
// ============================================================================
static bool initBattery() {
  if (batteryReady) return true;
  adc_oneshot_unit_init_cfg_t initCfg = {};
  initCfg.unit_id = ADC_UNIT_1;
  if (adc_oneshot_new_unit(&initCfg, &batteryAdc) != ESP_OK) return false;

  adc_oneshot_chan_cfg_t chanCfg = {};
  chanCfg.bitwidth = ADC_BITWIDTH_12;
  chanCfg.atten = ADC_ATTEN_DB_12;
  if (adc_oneshot_config_channel(batteryAdc, BATTERY_ADC_CHANNEL, &chanCfg) != ESP_OK) {
    adc_oneshot_del_unit(batteryAdc);   // bez tego uchwyt jednostki ADC wycieka przy kazdej probie
    batteryAdc = nullptr;
    return false;
  }

  adc_cali_curve_fitting_config_t caliCfg = {};
  caliCfg.unit_id = ADC_UNIT_1;
  caliCfg.atten = ADC_ATTEN_DB_12;
  caliCfg.bitwidth = ADC_BITWIDTH_12;
  batteryCaliReady = adc_cali_create_scheme_curve_fitting(&caliCfg, &batteryCali) == ESP_OK;
  batteryReady = true;
  return true;
}

// Krzywa OCV->SoC dla Samsung INR18650-35E (Li-ion NMC), znormalizowana do
// ramki firmware: 3.00 V = 0% (BATTERY_EMPTY_VOLTAGE), 4.20 V = 100% (BATTERY_FULL_VOLTAGE).
// Rozladowanie Li-ion jest NIELINIOWE: plaski srodek 3.70-3.91 V obejmuje az ~43-71% SoC,
// a konce sa strome. Liniowe mapowanie napiecia zawyzalo srodek i zanizalo okolice pelna.
// Interpolacja liniowa miedzy punktami tabeli. Koszt: kilka porownan co 10 min -> zero
// dodatkowego poboru pradu (brak licznika kulombow, brak rezystora pomiarowego).
static uint8_t percentFromVoltage(float v) {
  static const struct { float v; uint8_t soc; } OCV[] = {
    { 3.00f,   0 }, { 3.10f,   2 }, { 3.20f,   4 }, { 3.30f,   7 },
    { 3.40f,  11 }, { 3.45f,  14 }, { 3.50f,  18 }, { 3.55f,  23 },
    { 3.60f,  29 }, { 3.65f,  36 }, { 3.70f,  43 }, { 3.73f,  47 },
    { 3.76f,  51 }, { 3.79f,  55 }, { 3.82f,  59 }, { 3.85f,  63 },
    { 3.88f,  68 }, { 3.91f,  71 }, { 3.95f,  76 }, { 4.00f,  80 },
    { 4.05f,  87 }, { 4.10f,  93 }, { 4.15f,  97 }, { 4.20f, 100 },
  };
  const uint8_t N = sizeof(OCV) / sizeof(OCV[0]);
  if (v <= OCV[0].v)   return 0;
  if (v >= OCV[N-1].v) return 100;
  for (uint8_t i = 1; i < N; i++) {
    if (v < OCV[i].v) {
      float frac = (v - OCV[i-1].v) / (OCV[i].v - OCV[i-1].v);
      return (uint8_t)(OCV[i-1].soc + frac * (OCV[i].soc - OCV[i-1].soc) + 0.5f);
    }
  }
  return 100;
}

static uint8_t stabilizePercent(uint8_t measured) {
  if (measured >= BATTERY_FULL_FLOOR) return 100;
  if (batteryHasReading && batteryPercent == 100 && measured >= BATTERY_FULL_HOLD_FLOOR) return 100;
  return measured;
}

// Zapis zwiezlego podsumowania zuzycia do NVS najwyzej raz na dobe (nadpisywany,
// ograniczone zuzycie flash). Przezywa wymiane ogniwa.
static void maybeWriteDailySummary(time_t now) {
  struct tm t; localtime_r(&now, &t);
  int day = localDayKey(t);
  if (day == g_lastSummaryDay) return;
  float perDay = drainMahPerDay(g_drain);
  if (perDay < 0.0f) return;                  // brak sensownej estymaty
  g_lastSummaryDay = day;                      // oznacz dzien nim sprobujesz zapisu (R1): martwy NVS nie ma byc ponawiany co petle
  if (!prefs.begin(NVS_NS, false)) return;
  prefs.putUShort("drnSoc", batteryPercent);
  prefs.putFloat("drnMahDay", perDay);
  prefs.putUInt("drnDay", (uint32_t)day);
  prefs.end();
  Serial.printf("Zuzycie: %.1f mAh/dzien, ~%.0f dni\n",
                perDay, drainDaysRemaining(g_drain, batteryPercent));
}

static void updateBattery(bool force) {
  if (!force && (int32_t)(millis() - batteryNextReadMs) < 0) return;

  // Idle-gating: pod obciazeniem (odtwarzanie MP3, dzwoniacy budzik, aktywny serwer web)
  // napiecie zacisku siada przez rezystancje wewnetrzna ogniwa (~50 mOhm) -> pomiar
  // zanizony, krzywa OCV->SoC zaklada napiecie spoczynkowe. Odlozyc pomiar do bezczynnosci,
  // ponawiajac szybko (BATTERY_BUSY_RETRY_MS) zamiast kasowac caly interwal.
  // force pomija bramke: cold boot / wybudzenie potrzebuja wartosci od razu.
  if (!force && (playing || ringing || webActive)) {
    batteryNextReadMs = millis() + BATTERY_BUSY_RETRY_MS;
    return;
  }

