Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
  batteryNextReadMs = millis() + BATTERY_READ_INTERVAL_MS;
  if (!initBattery()) {
    batteryNextReadMs = millis() + BATTERY_BUSY_RETRY_MS;
    return;
  }

  uint32_t sum = 0;
  uint8_t samples = 0;
  for (uint8_t i = 0; i < BATTERY_SAMPLE_COUNT; i++) {
    int raw = 0;
    if (adc_oneshot_read(batteryAdc, BATTERY_ADC_CHANNEL, &raw) == ESP_OK) {
      sum += (uint32_t)raw;
      samples++;
    }
  }
  if (samples == 0) {
    batteryNextReadMs = millis() + BATTERY_BUSY_RETRY_MS;
    return;
  }

  int raw = (int)((sum + samples / 2) / samples);
  int mv = 0;
  if (batteryCaliReady) adc_cali_raw_to_voltage(batteryCali, raw, &mv);
  else mv = (raw * 3300) / 4095;

  float measured = (mv * 0.001f) * BATTERY_DIVIDER_RATIO * BATTERY_VOLTAGE_CALIBRATION;
  if (!batteryHasReading || force) { batteryVoltage = measured; batteryHasReading = true; }
  else batteryVoltage = batteryVoltage * 0.80f + measured * 0.20f;

  uint8_t old = batteryPercent;
  batteryPercent = stabilizePercent(percentFromVoltage(batteryVoltage));
  time_t nowT = time(nullptr);
  if (isSupportedEpoch(nowT)) {
    drainOnSample(g_drain, (int64_t)nowT, batteryPercent);
    maybeWriteDailySummary(nowT);
#if ENABLE_DIAGNOSTICS
    if (g_coldBootEpoch == 0) g_coldBootEpoch = (int64_t)nowT;   // kotwica czasu pracy
#endif
  }
  if (force || old != batteryPercent) displayDirty = true;
}

#if ENABLE_LOW_BATTERY_PROTECT
// Tryb oszczedny: pomiar wiarygodny i SoC <= prog. Wstrzymuje energochlonne WiFi/NTP.
static bool batteryLow() {
  return batteryHasReading && batteryPercent <= BATTERY_LOW_PERCENT;
}

// Stan krytyczny: ogniwo blisko bezpiecznego minimum. updateBattery() bramkuje
// pomiar pod obciazeniem, wiec batteryVoltage to napiecie spoczynkowe (OCV).
static bool batteryCritical() {
  return batteryHasReading &&
         (batteryVoltage <= BATTERY_CRITICAL_VOLTAGE || batteryPercent <= BATTERY_CRITICAL_PERCENT);
}
#endif

// ============================================================================
//  Rysowanie (U8g2)
// ============================================================================
static void drawPhotoGlyph(int x, int y, int glyph, bool colon) {
  uint16_t p = colon ? PHOTO_COLON_OFFSET : pgm_read_word(&PHOTO_DIGIT_OFFSET[glyph]);
  for (int row = 0; row < PHOTO_DIGIT_H; row++) {
    uint8_t segs = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
    for (uint8_t i = 0; i < segs; i++) {
      uint8_t start = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      uint8_t width = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      gfx->drawHLine(x + start, y + row, width);
    }
  }
  if (!colon && glyph == 4) {          // pelna stopka cyfry 4 (font ma ja skrocona)
    gfx->drawBox(x + 39, y + 112, 41, 13);
    gfx->drawBox(x + 40, y + 125, 31, 25);
  }
}

static void drawLargeTime(uint8_t hour, uint8_t minute, int y) {
  int totalW = PHOTO_DIGIT_W * 4 + PHOTO_COLON_W + PHOTO_DIGIT_GAP * 4;
  int x = (LCD_WIDTH - totalW) / 2 + PHOTO_TIME_X_SHIFT;
  drawPhotoGlyph(x, y, hour / 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, hour % 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x + PHOTO_COLON_X_SHIFT, y + PHOTO_COLON_Y_SHIFT, 0, true);
  x += PHOTO_COLON_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute / 10, false); x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute % 10, false);
}

static void drawBellIcon(int x, int y, bool active) {
  gfx->setDrawColor(1);
  gfx->drawDisc(x + 12, y + 10, 8);
  gfx->drawBox(x + 5, y + 10, 15, 11);
  gfx->drawBox(x + 3, y + 20, 19, 4);
  gfx->drawDisc(x + 12, y + 25, 3);
  gfx->drawBox(x + 9, y + 3, 7, 4);
  if (!active) {
    gfx->drawLine(x + 1, y + 26, x + 25, y + 2);
    gfx->drawLine(x + 2, y + 26, x + 26, y + 2);
  }
}

static void drawBatteryIcon(int x, int y, uint8_t percent) {
  if (percent > 100) percent = 100;
  gfx->drawFrame(x, y, 28, 13);
  gfx->drawBox(x + 28, y + 4, 3, 5);
  int fill = map(percent, 0, 100, 0, 24);
  if (fill > 0) gfx->drawBox(x + 2, y + 2, fill, 9);
  char txt[8];
  snprintf(txt, sizeof(txt), "%u%%", percent);
  gfx->setFont(u8g2_font_7x14_tf);
  gfx->drawStr(x - 42, y + 12, txt);
}

static void drawCentered(const char *text, int y) {
  int w = gfx->getStrWidth(text);
  int x = (LCD_WIDTH - w) / 2;
  if (x < 0) x = 0;
  gfx->drawStr(x, y, text);
}

static bool anyAlarmEnabled() {
  for (int i = 0; i < ALARM_COUNT; i++) if (alarms[i].enabled) return true;
  return false;
}

// Najblizszy wlaczony budzik (dzis lub jutro). Zwraca indeks lub -1.
static int nextAlarmIndex(uint8_t *h, uint8_t *mi, uint8_t *s, char *label, size_t labelSize) {
  struct tm t;
  bool hasTime = getLocalTm(&t);
  time_t now = hasTime ? time(nullptr) : 0;
  // Ranking po rzeczywistym epoch (mktime), nie po sekundach doby: w noc zmiany
  // czasu kolejnosc wg godzin sciennych klamie (02:45 dzwoni PO 03:15), a ekran
  // pokazywalby inny budzik niz ten, ktory faktycznie odpali pierwszy.
  long bestDelta = LONG_MAX;
  int best = -1;
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms[i].enabled) continue;
    long delta;
    if (hasTime) {
      time_t cand = epochForClock(t, alarms[i].hour, alarms[i].minute, alarms[i].second, 0);
      if (cand <= now) cand = epochForClock(t, alarms[i].hour, alarms[i].minute, alarms[i].second, 1);
      delta = (long)(cand - now);
    } else {
      delta = i;
    }
    if (delta < bestDelta) {
      bestDelta = delta;
      best = i;
      if (h) *h = alarms[i].hour;
      if (mi) *mi = alarms[i].minute;
      if (s) *s = alarms[i].second;
      if (label && labelSize) { strncpy(label, alarms[i].label, labelSize - 1); label[labelSize - 1] = 0; }
    }
  }
  return best;
}

// Sygnatura wszystkiego, co RYSUJE strona zegara (drawClockPage): HH:MM, %aku,
// stan/godzina najblizszego budzika, WWW on/off. Pola niepokazywane tutaj
// (ntpStatus, statusText) nie wchodza do sygnatury -> brak pelnoklatkowego
// sendBuffer() identycznej zawartosci na panelu refleksyjnym (zero mrugniec).
static uint32_t clockSig(const struct tm &t, int day) {
  uint8_t nh = 0, nm = 0;
  int next = nextAlarmIndex(&nh, &nm, nullptr, nullptr, 0);
  uint32_t h = 2166136261u;                           // FNV-1a
  auto mix = [&](uint32_t v) { h = (h ^ v) * 16777619u; };
  mix((uint32_t)t.tm_hour);
  mix((uint32_t)t.tm_min);
  mix((uint32_t)day);
  mix((uint32_t)batteryPercent);
  mix(webActive ? 1u : 0u);
  mix(anyAlarmEnabled() ? 1u : 0u);
  mix(next >= 0 ? (uint32_t)(nh * 60 + nm + 1) : 0u);  // +1: brak budzika != 00:00
  return h;
}

static void drawClockPage(const struct tm &t) {
  uint8_t nh = 0, nm = 0;
  int next = nextAlarmIndex(&nh, &nm, nullptr, nullptr, 0);
  bool alarmOn = anyAlarmEnabled();

  gfx->clearBuffer();
  gfx->setDrawColor(1);
  drawBatteryIcon(360, 8, batteryPercent);

  int y = (LCD_HEIGHT - PHOTO_DIGIT_H) / 2 + PHOTO_TIME_Y_SHIFT;
  drawLargeTime(t.tm_hour, t.tm_min, y);

  gfx->drawHLine(0, 264, LCD_WIDTH);
  drawBellIcon(10, 270, alarmOn);
  gfx->setFont(u8g2_font_7x14_tf);
  char bottom[80];
  if (next >= 0) {
    snprintf(bottom, sizeof(bottom), "Budzik %02u:%02u %s  Aku %u%%  WWW:%s",
             nh, nm, alarmOn ? "ON" : "OFF", batteryPercent, webActive ? "ON" : "OFF");
  } else {
    snprintf(bottom, sizeof(bottom), "Budzik --:-- OFF  Aku %u%%  WWW:%s",
             batteryPercent, webActive ? "ON" : "OFF");
  }
  gfx->drawStr(42, 287, bottom);
  gfx->sendBuffer();
}

