Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
static void pageHeader(String &h) {
  h += F("<!doctype html><html><head><meta charset='utf-8'>"
         "<meta name='viewport' content='width=device-width,initial-scale=1'>"
         "<title>Zegar NTP</title><style>"
         "body{font-family:system-ui,Arial;margin:16px;background:#f5f5f5;color:#111}"
         "main{max-width:760px;margin:auto}section{background:#fff;border:1px solid #ddd;padding:12px;margin:12px 0}"
         "input,button,select{font:inherit;padding:6px;margin:3px}label{display:inline-block;margin:4px 8px 4px 0}"
         "table{width:100%;border-collapse:collapse}td,th{border-bottom:1px solid #ddd;padding:6px;text-align:left}"
         ".row{display:flex;gap:8px;flex-wrap:wrap;align-items:center}.muted{color:#666}"
         "</style></head><body><main><h1>Zegar NTP — 3 budziki</h1>"
         "<p class='muted'>" FW_NAME " v" FW_VERSION " &middot; build " FW_BUILD_DATE " " FW_BUILD_TIME "</p>");
}

static void handleRoot() {
  webUntilMs = millis() + WEB_WINDOW_MS;
  // Nie wymuszaj pomiaru podczas pracy WiFi. OCV mierzone pod obciazeniem
  // zaniza procent akumulatora; updateBattery() wykona pomiar po zamknieciu WWW.
  updateBattery(false);
  String html;
  html.reserve(14000);
  pageHeader(html);

  html += F("<section><b>Status</b><p>Czas: ");
  html += currentTimeText();
  html += F("<br>Budzik: ");        html += htmlEscape(statusText);
  html += F("<br>NTP: ");           html += htmlEscape(ntpStatus);
  html += F("<br>Pliki MP3: ");     html += htmlEscape(dataFSName);
  html += F("<br>Akumulator: ");    html += batteryPercent;
  html += F("% (");                 html += String(batteryVoltage, 2);
  html += F(" V, ok. ");            html += String((uint32_t)batteryPercent * BATTERY_CAPACITY_MAH / 100U);
  html += F(" mAh)<br>IP: ");       html += WiFi.localIP().toString();
  {
    float perDay = drainMahPerDay(g_drain);
    float daysLeft = drainDaysRemaining(g_drain, batteryPercent);
    html += F("<br>Zuzycie: ");
    if (perDay < 0)        html += F("zbieram dane (min ~6 h)");
    else if (perDay == 0)  html += F("brak mierzalnego zuzycia");
    else {
      html += String(perDay, 1); html += F(" mAh/dzien, ~");
      html += String(daysLeft, 0); html += F(" dni do rozladowania");
    }
  }
  html += F("</p><p><a href='/sync'><button>Synchronizuj NTP</button></a>"
            "<a href='/stop'><button>Stop MP3</button></a>");
#if ENABLE_DIAGNOSTICS
  html += F("<a href='/info'><button>Informacje</button></a>");
#endif
  html += F("</p></section>");

  html += F("<form method='post' action='/save'>");

  // Hasla nie wpisujemy w HTML: kazdy w LAN moglby je odczytac ze zrodla
  // strony (panel nie ma logowania). Puste pole przy zapisie = bez zmian.
  html += F("<section><b>WiFi</b><div class='row'><label>SSID <input name='ssid' value='");
  html += htmlEscape(wifiSsid);
  html += F("'></label><label>Haslo <input name='pass' type='password' placeholder='(bez zmian)'>"
            "</label></div><p class='muted'>Puste pole hasla = haslo bez zmian.</p></section>");

  html += F("<section><b>Budziki</b><table>"
            "<tr><th>Wl.</th><th>Czas</th><th>Glos.</th><th>Dzwiek</th><th>Nazwa</th></tr>");
  for (int i = 0; i < ALARM_COUNT; i++) {
    char timeBuf[16];
    snprintf(timeBuf, sizeof(timeBuf), "%02u:%02u:%02u", alarms[i].hour, alarms[i].minute, alarms[i].second);
    html += F("<tr><td><input type='checkbox' name='en"); html += i; html += F("' ");
    if (alarms[i].enabled) html += F("checked");
    html += F("></td><td><input type='time' step='1' name='time"); html += i;
    html += F("' value='"); html += timeBuf;
    html += F("'></td><td><input type='number' min='0' max='21' name='vol"); html += i;
    html += F("' value='"); html += alarms[i].volume;
    html += F("'></td><td><select name='snd"); html += i; html += F("'>");
    for (int sIdx = 0; sIdx < SOUND_COUNT; sIdx++) {
      html += F("<option value='"); html += sIdx; html += F("'");
      if (alarms[i].sound == sIdx) html += F(" selected");
      html += F(">"); html += SOUND_NAMES[sIdx]; html += F("</option>");
    }
    html += F("</select></td><td><input maxlength='15' name='label"); html += i;
    html += F("' value='"); html += htmlEscape(alarms[i].label);
    html += F("'></td></tr>");
  }
  html += F("</table><p class='muted'>Dzwiek 1/2/3 = pliki /alarm1.mp3 /alarm2.mp3 /alarm3.mp3 na partycji danych.</p></section>");

  html += F("<p><button type='submit'>Zapisz</button></p></form>");

  appendMp3Manager(html);

  html += F("<section><b>Test dzwiekow</b><div class='row'>");
  for (int sIdx = 0; sIdx < SOUND_COUNT; sIdx++) {
    html += F("<form method='post' action='/test' style='display:inline'>"
              "<input type='hidden' name='snd' value='"); html += sIdx;
    html += F("'><button type='submit'>Test "); html += SOUND_NAMES[sIdx];
    html += F("</button></form>");
  }
  html += F("</div></section>");

  html += F("</main></body></html>");
  server.send(200, "text/html", html);
}

static void handleSave() {
  webUntilMs = millis() + WEB_WINDOW_MS;
  if (server.hasArg("ssid")) {
    String ssid = server.arg("ssid"); ssid.trim();
    ssid.toCharArray(wifiSsid, sizeof(wifiSsid));
  }
  // Formularz nie odsyla biezacego hasla (pole w HTML jest puste), wiec
  // puste pole oznacza "zostaw stare", a nie "ustaw puste".
  if (server.hasArg("pass") && server.arg("pass").length() > 0) {
    String pass = server.arg("pass");
    pass.toCharArray(wifiPass, sizeof(wifiPass));
  }

  for (int i = 0; i < ALARM_COUNT; i++) {
    String idx = String(i);
    uint8_t prevEnabled = alarms[i].enabled;
    uint8_t prevH = alarms[i].hour, prevM = alarms[i].minute, prevS = alarms[i].second;

    alarms[i].enabled = server.hasArg(String("en") + idx) ? 1 : 0;
    uint8_t h, m, s;
    if (parseClock(server.arg(String("time") + idx), &h, &m, &s)) {
      alarms[i].hour = h; alarms[i].minute = m; alarms[i].second = s;
    }

    // Ponowne uzbrojenie: jesli zmieniono czas lub budzik wlaczono na nowo,
    // skasuj znacznik "juz dzis dzwonil", aby mogl odpalic ponownie tego dnia.
    bool timeChanged = (alarms[i].hour != prevH || alarms[i].minute != prevM ||
                        alarms[i].second != prevS);
    bool reEnabled   = (alarms[i].enabled && !prevEnabled);
    if (timeChanged || reEnabled) lastTriggerDay[i] = -1;

    String volumeArg = String("vol") + idx;
    String soundArg = String("snd") + idx;
    String labelArg = String("label") + idx;
    if (server.hasArg(volumeArg)) {
      alarms[i].volume = constrain(server.arg(volumeArg).toInt(), 0, MAX_AUDIO_VOLUME);
    }
    if (server.hasArg(soundArg)) {
      alarms[i].sound = constrain(server.arg(soundArg).toInt(), 0, SOUND_COUNT - 1);
    }
    if (server.hasArg(labelArg)) {
      String label = server.arg(labelArg); label.trim();
      if (label.length() == 0) label = "Budzik " + String(i + 1);
      label.toCharArray(alarms[i].label, sizeof(alarms[i].label));
    }
    sanitizeAlarm(alarms[i], i);
  }
  saveSettings();
  displayDirty = true;
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

static void handleSync() {
  syncNtp(true);
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

static void handleStop() {
  stopPlayback(true);
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

static void handleTest() {
  // Nie przerywaj dzwoniacego budzika testem z panelu: startSound() nie kasuje
  // stanu ringing (userStopped=false), wiec serviceRinging() wznowilby budzik po
  // RING_RETRY_MS i test bilby sie z budzikiem o kodek. Pomin test podczas dzwonienia.
  if (!ringing) {
    uint8_t sIdx = constrain(server.arg("snd").toInt(), 0, SOUND_COUNT - 1);
    startSound(sIdx, DEFAULT_AUDIO_VOLUME);
  }
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

static void handleMp3UploadDone() {
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

static void handleMp3UploadStream() {
  webUntilMs = millis() + WEB_WINDOW_MS;
  watchdogFeed();   // callback wolany per fragment: upload duzego MP3 blokuje loop() minutami
  HTTPUpload &upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    if (mp3UploadFile) mp3UploadFile.close();
    mp3UploadAccepted = false;
    mp3UploadHadData = false;
    mp3UploadPath = "";
    mp3UploadTempPath = "";

    if (!normalizeMp3Path(upload.filename, mp3UploadPath, false)) {
      statusText = "zla nazwa MP3";
      displayDirty = true;
      return;
    }
    if (!ensureFsMounted()) {
      statusText = "brak FS dla MP3";
      displayDirty = true;
      return;
    }

    if (playing || ringing) stopPlayback(true);
    mp3UploadTempPath = mp3UploadPath + ".part";
    if (dataFS->exists(mp3UploadTempPath)) dataFS->remove(mp3UploadTempPath);
    mp3UploadFile = dataFS->open(mp3UploadTempPath, FILE_WRITE);
    mp3UploadAccepted = (bool)mp3UploadFile;
    statusText = mp3UploadAccepted ? String("upload ") + mp3UploadPath : "blad zapisu MP3";
    displayDirty = true;
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (mp3UploadAccepted && mp3UploadFile) {
      size_t written = mp3UploadFile.write(upload.buf, upload.currentSize);
      if (written != upload.currentSize) {
        mp3UploadAccepted = false;
        statusText = "blad zapisu MP3";
      } else if (upload.currentSize > 0) {
        mp3UploadHadData = true;
      }
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (mp3UploadFile) mp3UploadFile.close();
    if (mp3UploadAccepted && mp3UploadHadData) {
      String backupPath = mp3UploadPath + ".bak";
      if (dataFS->exists(backupPath)) dataFS->remove(backupPath);

      bool hadOld = dataFS->exists(mp3UploadPath);
      bool oldMoved = !hadOld ||
                      dataFS->rename(mp3UploadPath, backupPath);
      bool newInstalled = oldMoved &&
                          dataFS->rename(mp3UploadTempPath, mp3UploadPath);

      if (newInstalled) {
        if (dataFS->exists(backupPath)) dataFS->remove(backupPath);
        statusText = String("dodano ") + mp3UploadPath;
      } else {
        if (oldMoved && hadOld) {
          if (dataFS->exists(mp3UploadPath)) dataFS->remove(mp3UploadPath);
          if (dataFS->exists(backupPath)) dataFS->rename(backupPath, mp3UploadPath);
        }
        if (dataFS->exists(mp3UploadTempPath)) dataFS->remove(mp3UploadTempPath);
        statusText = "blad instalacji MP3";
      }
    } else {
      if (mp3UploadTempPath.length() && dataFS && dataFS->exists(mp3UploadTempPath)) {
        dataFS->remove(mp3UploadTempPath);
      }
      if (statusText == String("upload ") + mp3UploadPath) statusText = "pusty MP3";
    }
    displayDirty = true;
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    if (mp3UploadFile) mp3UploadFile.close();
    if (mp3UploadTempPath.length() && dataFS && dataFS->exists(mp3UploadTempPath)) {
      dataFS->remove(mp3UploadTempPath);
    }
    statusText = "upload przerwany";
    displayDirty = true;
  }
}

