Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
static void handleMp3Delete() {
  String path;
  if (!normalizeMp3Path(server.arg("file"), path, true)) {
    statusText = "zla nazwa MP3";
  } else if (!ensureFsMounted()) {
    statusText = "brak FS dla MP3";
  } else {
    if (playing || ringing) stopPlayback(true);
    statusText = (dataFS->exists(path) && dataFS->remove(path)) ?
                 String("usunieto ") + path : String("brak ") + path;
  }
  displayDirty = true;
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

#if ENABLE_DIAGNOSTICS
// Strona /info — diagnostyka produkcyjna (tylko odczyt, bez danych wrazliwych).
static void handleInfo() {
  webUntilMs = millis() + WEB_WINDOW_MS;
  updateBattery(false);   // bez wymuszania: pod WiFi pomiar zanizony, OCV po zamknieciu WWW
  String html;
  html.reserve(4500);
  pageHeader(html);
  html += F("<section><b>Informacje / diagnostyka</b><table>");

  auto row = [&](const char *k, const String &v) {
    html += F("<tr><td>"); html += k; html += F("</td><td>"); html += htmlEscape(v); html += F("</td></tr>");
  };

  row("Nazwa", FW_NAME);
  row("Wersja", String("v" FW_VERSION));
  row("Kompilacja", String(FW_BUILD_DATE) + " " + FW_BUILD_TIME);
  row("Czas lokalny", currentTimeText());
  row("Przyczyna ostatniego resetu", resetReasonText(esp_reset_reason()));
  row("Rozruchy od zimnego startu", String(g_bootCount));

  // Czas pracy od zimnego startu (RTC RAM przezywa noce; znika po wymianie ogniwa).
  {
    time_t now = time(nullptr);
    if (isSupportedEpoch(now) && g_coldBootEpoch > 0) {
      long s = (long)(now - (time_t)g_coldBootEpoch);
      if (s < 0) s = 0;
      char buf[48];
      snprintf(buf, sizeof(buf), "%ld dni %02ld:%02ld:%02ld",
               s / 86400, (s % 86400) / 3600, (s % 3600) / 60, s % 60);
      row("Czas pracy (od zimnego startu)", buf);
    } else {
      row("Czas pracy (od zimnego startu)", "ustala sie");
    }
  }

  row("Resety brownout / WDT / panic",
      String(g_brownoutResets) + " / " + String(g_wdtResets) + " / " + String(g_panicResets));

  row("Heap wolny", String(ESP.getFreeHeap()) + " B");
  row("Heap min. od startu", String(ESP.getMinFreeHeap()) + " B");
  row("Heap najwiekszy blok", String(ESP.getMaxAllocHeap()) + " B");

  if (g_lastNtpSyncEpoch > 0 && g_prevNtpSyncEpoch > 0) {
    long winH = (long)((g_lastNtpSyncEpoch - g_prevNtpSyncEpoch) / 3600);
    row("Dryft RTC (ostatni sync)", String(g_lastRtcDriftSec) + " s / ~" + String(winH) + " h");
  } else {
    row("Dryft RTC (ostatni sync)", "brak danych (min. 2 synchronizacje)");
  }

  row("Akumulator", String(batteryPercent) + "% (" + String(batteryVoltage, 2) + " V)");
#if ENABLE_LOW_BATTERY_PROTECT
  row("Ochrona ogniwa", batteryCritical() ? "KRYTYCZNY" : (batteryLow() ? "tryb oszczedny (bez auto-NTP)" : "OK"));
#endif

  if (WiFi.status() == WL_CONNECTED) {
    row("WiFi", WiFi.SSID() + "  RSSI " + String(WiFi.RSSI()) + " dBm");
    row("IP", WiFi.localIP().toString());
  } else {
    row("WiFi", "rozlaczone");
  }
  row("System plikow", dataFSName);

  html += F("</table><p><a href='/'><button>Powrot</button></a></p></section>");
  html += F("</main></body></html>");
  server.send(200, "text/html", html);
}
#endif // ENABLE_DIAGNOSTICS

static bool startWebWindow() {
  if (webActive) {
    if (WiFi.status() == WL_CONNECTED) {
      webUntilMs = millis() + WEB_WINDOW_MS;
      displayDirty = true;
      return true;
    }
    server.stop();
    webActive = false;
  }
  if (!ensureWifi(NTP_WIFI_TIMEOUT_MS)) {
    statusText = "brak polaczenia WiFi";
    stopWifiAndNtp();
    displayDirty = true;
    return false;
  }
  if (!webRoutesInstalled) {
    server.on("/", HTTP_GET, handleRoot);
    server.on("/save", HTTP_POST, handleSave);
    server.on("/sync", HTTP_GET, handleSync);
    server.on("/stop", HTTP_GET, handleStop);
    server.on("/test", HTTP_POST, handleTest);
    server.on("/mp3upload", HTTP_POST, handleMp3UploadDone, handleMp3UploadStream);
    server.on("/mp3delete", HTTP_POST, handleMp3Delete);
#if ENABLE_DIAGNOSTICS
    server.on("/info", HTTP_GET, handleInfo);
#endif
    webRoutesInstalled = true;
  }
  server.begin();
  webActive = true;
  webUntilMs = millis() + WEB_WINDOW_MS;
  displayDirty = true;
  Serial.print("WWW IP: ");
  Serial.println(WiFi.localIP());
  return true;
}

static void stopWebWindow() {
  server.stop();
  webActive = false;
  // Aktywna proba NTP trwa najwyzej kilkadziesiat sekund (timeout pakietu 50 s,
  // NTP_PACKET_TIMEOUT_MS). Pozwol jej zakonczyc walidacje i zapis RTC;
  // finishNtpAttempt() sam wtedy wylaczy WiFi.
  if (ntpSyncState == NTP_SYNC_IDLE) stopWifiAndNtp();
  displayDirty = true;
}

// ============================================================================
//  Sprawdzanie budzikow i harmonogram NTP
// ============================================================================
static void checkAlarms(uint32_t lateWindowSec) {
  if (playing || ringing) return;
  time_t now = time(nullptr);
  struct tm t;
  if (!isSupportedEpoch(now)) return;
  localtime_r(&now, &t);
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms[i].enabled) continue;
    int occurrenceDay;
    if (alarmDueNow(t, now, alarms[i].hour, alarms[i].minute, alarms[i].second,
                    lateWindowSec, &occurrenceDay) &&
        lastTriggerDay[i] != occurrenceDay) {
      lastTriggerDay[i] = occurrenceDay;
      // Skonsumuj pozostale budziki wymagalne w tej samej chwili (np. kolizja
      // godzin w noc wiosennej zmiany czasu: 02:30 i 03:30 to ten sam epoch).
      // Bez tego drugi z nich po wyciszeniu pierwszego mial juz przeterminowane
      // okno i przepadal bez sladu; swiadomie laczymy je w jedno dzwonienie.
      for (int j = 0; j < ALARM_COUNT; j++) {
        int otherDay;
        if (j != i && alarms[j].enabled &&
            alarmDueNow(t, now, alarms[j].hour, alarms[j].minute, alarms[j].second,
                        lateWindowSec, &otherDay)) {
          lastTriggerDay[j] = otherDay;
        }
      }
      startRinging(i);
      return;
    }
  }
}

static void checkNtpSchedule() {
#if ENABLE_LOW_BATTERY_PROTECT
  // Tryb oszczedny: gdy mamy poprawny czas, NIE budz WiFi do auto-synchronizacji
  // (najwiekszy pobor pradu). Zegar chodzi z RTC; reczny sync z panelu WWW dziala.
  // Gdy czasu brak (pusty RTC), pozwol sie synchronizowac mimo niskiej baterii.
  if (batteryLow() && isSupportedEpoch(time(nullptr))) return;
#endif
  if (handleNtpRetry()) return;
  struct tm t;
  if (!getLocalTm(&t)) return;
  int day = localDayKey(t);
  // Preferowane okno 10:00-10:05; jesli pominiete (np. dlugi upload MP3 blokuje
  // petle przez kilka minut), dogon synchronizacje o dowolnej porze az do poczatku
  // nocy. ntpStartedDay gwarantuje dokladnie jeden sync na dobe.
  bool preferredWindow = (t.tm_hour == NTP_HOUR && t.tm_min <= NTP_MIN_WINDOW);
  bool catchupWindow   = (t.tm_hour >= NTP_HOUR && t.tm_hour < NIGHT_START_HOUR);
  if ((preferredWindow || catchupWindow) && ntpStartedDay != day) {
    ntpStartedDay = day;
    ntpRetriesLeft = 2;
    ntpFailureRetryDelayMs = NTP_RETRY_MS;
    syncNtp(false);
  }
}

// ============================================================================
//  Tryb nocny (deep-sleep) i oszczedzanie energii w petli (light-sleep)
// ============================================================================
static bool anyAlarmDueNow(const struct tm &t) {
  time_t now = time(nullptr);
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (alarms[i].enabled &&
        alarmDueNow(t, now, alarms[i].hour, alarms[i].minute, alarms[i].second,
                    ALARM_LATE_WINDOW_SEC, nullptr))
      return true;
  }
  return false;
}

