Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v4.0.ino
  struct tm t;
  localtime_r(&now, &t);

  // 1) Do granicy nastepnej minuty (1..60 s).
  uint64_t sleepSec = 60 - (uint64_t)t.tm_sec;

  // 2) Do sekundy najblizszego budzika, jesli wypada wczesniej.
  time_t alarmAt = nextAlarmEpoch(t, now);
  if (alarmAt > now) {
    uint64_t toAlarm = (uint64_t)(alarmAt - now);
    if (toAlarm < sleepSec) sleepSec = toAlarm;
  }

  // 3) Twardy limit 60 s = sen dokladnie do granicy minuty (bezpiecznik + okresowe
  //    zadania: bateria co 10 min, NTP 10:00, panel WWW). Zegar pokazuje HH:MM, wiec
  //    czesciej niz raz na minute budzic sie nie trzeba; budzik ma osobny, dokladny
  //    termin (pkt 2), a KEY/BOOT wybudzaja przez EXT1 niezaleznie od dlugosci snu.
  if (sleepSec > IDLE_LIGHT_SLEEP_MAX_SEC) sleepSec = IDLE_LIGHT_SLEEP_MAX_SEC;
  if (sleepSec < 1) sleepSec = 1;

  return sleepSec * 1000000ULL;
}

static void idlePowerSave() {
  // Nie usypiaj na dlugo, gdy cos wymaga szybkiej obslugi w petli: panel WWW,
  // odtwarzanie/dzwonienie, podglad budzika, trwajaca synchronizacja NTP lub
  // zaplanowane zapisy do RTC (ponawiane co kilka sekund).
  if (webActive || playing || ringing || previewActive ||
      ntpSyncState != NTP_SYNC_IDLE || rtcWriteRetriesLeft != 0) { delay(5); return; }
  if (digitalRead(KEY_PIN) == LOW || digitalRead(PREVIEW_BUTTON_PIN) == LOW) { delay(5); return; }

  if (audioReady) shutdownCodec();   // kodek niepotrzebny w spoczynku -> uspij ES8311

  // Dzienna sciezka oszczedzania: WYLACZNIE light-sleep do granicy nastepnej minuty
  // / sekundy budzika. Light-sleep zachowuje RAM i NIE rebootuje, wiec setup() i
  // setupDisplay() (reset RST + display.begin() -> czyszczenie panelu) NIE sa
  // wywolywane ponownie -> ekran odswiezany w miejscu przez sendBuffer() -> BRAK
  // mrugania. Ten sam mechanizm sprawia, ze tryb www on nigdy nie mruga.
  //
  // Swiadomy kompromis: light-sleep pobiera ~1 mA vs ~0.02 mA deep-sleep (krotsza
  // praca na baterii), ale ekran przestaje mrugac przy zmianie minuty oraz przy
  // KEY/BOOT (wybudzenia EXT1 obslugiwane nizej w miejscu, bez rebootu). Nocny
  // deep-sleep (enterNightSleepIfNeeded) pozostaje bez zmian.
  esp_sleep_enable_timer_wakeup(computeIdleSleepUs());
  const uint64_t wakeMask = (1ULL << KEY_PIN) | (1ULL << PREVIEW_BUTTON_PIN);
  esp_err_t extWake = esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_LOW);
#if POWER_DOWN_FLASH_IN_SLEEP
  esp_sleep_pd_config(ESP_PD_DOMAIN_VDDSDIO, ESP_PD_OPTION_OFF);
#endif
  watchdogFeed();              // tuz przed snem: licznik TWDT rusza od zera
  esp_light_sleep_start();
  watchdogFeed();              // tuz po wybudzeniu: pojedynczy sen trwa do 60 s
  // ESP32-S3: EXT1 (esp_sleep_enable_ext1_wakeup) zostawia RTC-hold na padach
  // wybudzajacych. Bez zwolnienia KEY_PIN (GPIO18) i PREVIEW_BUTTON_PIN (GPIO0)
  // zostaja zatrzasniete na stanie ze snu -> digitalRead ponizej zwraca wartosc
  // zablokowana, przyciski martwe do restartu. Zwolnij od razu po wybudzeniu.
  rtc_gpio_hold_dis((gpio_num_t)KEY_PIN);
  rtc_gpio_hold_dis((gpio_num_t)PREVIEW_BUTTON_PIN);
  esp_sleep_wakeup_cause_t wakeCause = esp_sleep_get_wakeup_cause();
  uint64_t wakePins = wakeCause == ESP_SLEEP_WAKEUP_EXT1 ?
                      esp_sleep_get_ext1_wakeup_status() : 0;
  esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_TIMER);
  if (extWake == ESP_OK) esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_EXT1);

  // W light-sleep czas systemowy ESP32 korzysta z mniej dokladnego oscylatora
  // RTC slow clock. Po kazdym wybudzeniu zakotwicz go ponownie w PCF85063A,
  // aby dryft nie przesuwal zmiany minuty o kilka lub kilkadziesiat sekund.
  readRtcToSystem();

  if (wakeCause == ESP_SLEEP_WAKEUP_EXT1) {
    if (wakePins & (1ULL << KEY_PIN)) {
      keyRaw = digitalRead(KEY_PIN); keyStable = keyRaw; keyChangedMs = millis();
      startWebWindow();
    }
    if (wakePins & (1ULL << PREVIEW_BUTTON_PIN)) {
      bootRaw = LOW; bootStable = LOW; bootPressedMs = 0; bootChangedMs = millis();
      showPreview();
    }
  }
}

// ============================================================================
//  Przyciski
// ============================================================================
static void showPreview() {
  if (playing || ringing) return;
  previewActive = true;
  previewUntilMs = millis() + ALARM_PREVIEW_MS;
  displayDirty = true;
}

static void handleKey() {
  bool raw = digitalRead(KEY_PIN);
  if (raw != keyRaw) { keyRaw = raw; keyChangedMs = millis(); }
  if (millis() - keyChangedMs > BUTTON_DEBOUNCE_MS && raw != keyStable) {
    keyStable = raw;
    if (keyStable == LOW) {
      if (playing || ringing) stopPlayback(true);   // wycisz budzik
      else startWebWindow();                         // otworz panel WWW
    }
  }
}

static void handleBoot() {
  bool raw = digitalRead(PREVIEW_BUTTON_PIN);
  if (raw != bootRaw) { bootRaw = raw; bootChangedMs = millis(); }
  if (millis() - bootChangedMs > BUTTON_DEBOUNCE_MS && raw != bootStable) {
    bootStable = raw;
    if (bootStable == LOW) {
      bootPressedMs = millis();
    } else {
      uint32_t press = millis() - bootPressedMs;
      if (bootPressedMs != 0 && press <= BOOT_SHORT_PRESS_MS) showPreview();
      bootPressedMs = 0;
    }
  }
}

// ============================================================================
//  Inicjalizacja wyswietlacza
// ============================================================================
//   Pierwotnie cieple wybudzenie uzywalo display.initInterface() (tylko piny SPI,
//   bez init-seq) zakladajac, ze panel trzyma obraz przez sen. Na uzywanym
//   egzemplarzu ST7305 to NIE dziala: po deep-sleep panel jest martwy i sam
//   initInterface() go nie przywraca -> w trybie www off ekran zostaje czarny.
//   Dlatego pelny re-init (reset RST + display.begin()) przy KAZDYM wybudzeniu.
// Zarezerwowane: ST7305 HPM/LPM. Domyslnie nieaktywne (patrz spec 5.4). Bez sprzetowego
// testu nie wysylamy niezweryfikowanych komend do panelu.
static inline void st7305SetStaticLowPower(bool enable) {
#if ST7305_STATIC_LPM
  (void)enable;   // celowo puste do czasu testu sprzetowego
#else
  (void)enable;
#endif
}

